int/resources/objectRepo/xmlTemplates/opera/HotelConfig/req_CreateHousekeepingAttendants.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateHousekeepingAttendantsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Attendants>
            <v91:Attendant Inactive="?">
               <v91:HotelCode/>
               <v91:AttendantID/>
               <v91:Name/>
               <v91:PhoneNo/>
               <v91:Section/>
               <v91:Floor/>
               <v91:Job/>
               <v91:WorkingDays Friday="?" Monday="?" Saturday="?" Sunday="?" Thursday="?" Tuesday="?" Wednesday="?"/>
               <v91:AppUser/>
            </v91:Attendant>
         </v9:Attendants>
      </v9:CreateHousekeepingAttendantsRQ>
   </soapenv:Body>
</soapenv:Envelope>